Revit 2027 API
Application.IsLoggedIn Property
 Checks if the user is logged in from this session to their Autodesk account.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsLoggedIn { get; }
Public Shared ReadOnly Property IsLoggedIn As Boolean
	Get
public:
static property bool IsLoggedIn {
	bool get ();
}
static member IsLoggedIn : bool with get
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace